БИТУправление_медицинским_центром_демо/src/Documents/Событие/Событие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Событие</name>
  <basedOn>Document.Заявка</basedOn>
  <basedOn>Document.Событие</basedOn>
  <basedOn>Document.ЛистОжидания</basedOn>
  <basedOn>Task.ЗадачиПользователя</basedOn>
  <basedOn>Document.ОбратнаяСвязь</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеСобытия</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗвонка</name>
    <type>
      <types>CatalogRef.ТипыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходЗвонка</name>
    <type>
      <types>CatalogRef.ИсходыЗвонка</types>
    </type>
  </attributes>
  <attributes>
    <name>УспешностьЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокНачат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвонокЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЗвонка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьРазговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидЗвонка</name>
    <type>
      <types>EnumRef.фонВидыЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>бит_НабранныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРекламы</name>
    <comment>UTM_MEDIUM</comment>
    <type>
      <types>CatalogRef.ТипыРекламы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <comment>UTM_SOURCE</comment>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>РекламнаяКомпания</name>
    <comment>UTM_CAMPAIGN</comment>
    <type>
      <types>CatalogRef.РекламныеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоРекламнойКомпании</name>
    <comment>UTM_TERM</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОбъявления</name>
    <comment>UTM_CONTENT</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/CommonModules/CRMКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

// Открывает документ события, заполняя в нём заданные реквизиты.
//
// Параметры:
//  СобытиеСсылка	 - ДокументСсылка.Событие	 - документ события, если уже существует.
//  СтруктураСобытия - Структура				 - значения реквизитов для заполнения в документе события.
// 
// Возвращаемое значение:
//   ФормаКлиентскогоПриложения.
//
Функция ПолучитьФормуСобытия(СобытиеСсылка = Неопределено, СтруктураСобытия = Неопределено) Экспорт
	
	ФормаСобытия = ПолучитьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("Ключ", СобытиеСсылка));
	ФормаСобытия.Записать();
	
	Если СтруктураСобытия <> Неопределено Тогда
		ИсключаемыеСвойства = "";
		Если СтруктураСобытия.Свойство("Клиент") И ЗначениеЗаполнено(ФормаСобытия.Объект.Клиент) Тогда
			ИсключаемыеСвойства = "Клиент";
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ФормаСобытия.Объект, СтруктураСобытия, , ИсключаемыеСвойства);
		ФормаСобытия.Модифицированность = Истина;
		ФормаСобытия.НастроитьВидимостьДоступность();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаСобытия, "ДопСвойства")
		И ЗначениеЗаполнено(ФормаСобытия.Объект.НомерТелефона)
	Тогда
		ФормаСобытия.ДопСвойства.Вставить("ОбновитьСотовыйКлиента", Истина);
	КонецЕсли;
	
	Возврат ФормаСобытия;
	
КонецФункции

// Открывает реквизиты документа события, возвращая его форму.
//
// Параметры:
//  СобытиеСсылка		 - ДокументСсылка.Событие	 - документ события, если уже существует.
//  СтруктураСобытия	 - Структура				 - значения реквизитов для заполнения в документе события.
//  НеПереоткрыватьФорму - Булево					 - не открывает форму, если документ уже есть.
// 
// Возвращаемое значение:
//   ФормаКлиентскогоПриложения.
//
Функция ОбновитьДанныеСобытия(СобытиеСсылка = Неопределено, СтруктураСобытия = Неопределено, НеПереоткрыватьФорму = Истина) Экспорт
	
	ФормаСобытия = ПолучитьФормуСобытия(СобытиеСсылка, СтруктураСобытия);
	Если ФормаСобытия.Открыта() Тогда 
		ФормаСобытия.Активизировать();
	ИначеЕсли ЗначениеЗаполнено(СобытиеСсылка) И НеПереоткрыватьФорму И СтруктураСобытия <> Неопределено Тогда 
		CRMСервер.ДополнитьСобытие(СобытиеСсылка, СтруктураСобытия);
	Иначе
		ФормаСобытия.Открыть();
	КонецЕсли;
	
	Возврат ФормаСобытия;
	
КонецФункции

// Открывает полную форму списка листов ожидания.
//
Процедура ОткрытьАктивизироватьОчередь() Экспорт
	
	Форма = ПолучитьФорму("Документ.ЛистОжидания.ФормаСписка");
	Если Форма.Открыта() Тогда 
		Форма.Активизировать();
	Иначе
		Форма.Открыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
